a = (1, 2, 3)  # tuple = кортеж
print(type(a)) # tuple = кортеж

b = [1, 2, 3]  # list = список
print(type(b)) # list = список

c = {1, 2, 3, 3} # set = множество
print(type(c)) # set = множество

d = {1: 10, 2: 100, 3: 1000} # dict = словарь
print(type(d)) # dict = словарь

print(a, b, c, d)

            #Важно
            #Не передавайте списки задавая по умолчанию пустой список или другой изменяемый тип данных!
            #В таком случае, если этот список будет изменён внутри функции, то на следующий вызов функции он останется в том же состоянии.
            #def a(my_list = [])) – это приводит к ошибкам!\
            #Можно передавать вот так(список создаётся локально, мы не влияем на его изменение вне функции)
            #def append_to_list(item, list_my=None):
                #if list_my is None:
            #list_my = []
            #list_my.append(item)
